<?php
	/**
	 * Created by PhpStorm.
	 * User: Faks
	 * Date: 2017.06.19.
	 * Time: 23:20
*/
	function transliter($input)
	{
		$filter = '';

			$filter = strtr($input, array
			(
				    #Latvian: translit - upper case
				    'Ā' => 'A', 'Č' => 'C', 'Ē' => 'E', 'Ģ' => 'G', 'Ī' => 'I', 'Ķ' => 'K', 'Ļ' => 'L', 'Ņ' => 'N',
				    'Š' => 'S', 'Ū' => 'U', 'Ž' => 'Z',

				    #Latvian: translit - lower case
				    'ā' => 'a', 'č' => 'c', 'ē' => 'e', 'ģ' => 'g', 'ī' => 'i', 'ķ' => 'k', 'ļ' => 'l', 'ņ' => 'n',
				    'š' => 's', 'ū' => 'u', 'ž' => 'z',

				    #Russian: translit - upper case
				    'А' => 'A',   'Б' => 'B',   'В' => 'V',
				    'Г' => 'G',   'Д' => 'D',   'Е' => 'E',
				    'Ё' => 'Yo',   'Ж' => 'Zh',  'З' => 'Z',
				    'И' => 'I',   'Й' => 'Y',   'К' => 'K',
				    'Л' => 'L',   'М' => 'M',   'Н' => 'N',
				    'О' => 'O',   'П' => 'P',   'Р' => 'R',
				    'С' => 'S',   'Т' => 'T',   'У' => 'U',
				    'Ф' => 'F',   'Х' => 'H',   'Ц' => 'C',
				    'Ч' => 'Ch',  'Ш' => 'Sh',  'Щ' => 'Sch',
				    'Ь' => '\'',  'Ы' => 'Y',   'Ъ' => '\'',
				    'Э' => 'E',   'Ю' => 'Yu',  'Я' => 'Ya',

				    #Russian: translit - lower case
				    'а' => 'a',   'б' => 'b',   'в' => 'v',
				    'г' => 'g',   'д' => 'd',   'е' => 'e',
				    'ё' => 'yo',   'ж' => 'zh',  'з' => 'z',
				    'и' => 'i',   'й' => 'y',   'к' => 'k',
				    'л' => 'l',   'м' => 'm',   'н' => 'n',
				    'о' => 'o',   'п' => 'p',   'р' => 'r',
				    'с' => 's',   'т' => 't',   'у' => 'u',
				    'ф' => 'f',   'х' => 'h',   'ц' => 'c',
				    'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
				    'ь' => '\'',  'ы' => 'y',   'ъ' => '\'',
				    'э' => 'e',   'ю' => 'yu',  'я' => 'ya',
			));
			

		return $filter;
	}
